import sys

input = sys.stdin.readline

def check(count, s):
    global result
    if count == 10:
        if s > result:
            result = s
        return result

    for i in range(4):
        # i번 말의 현재 위치

        now = dice[i]

        if now == -1:
            continue
        # 현재 움직여야하는 이동 거리
        now_move_distance = arr[count]
        # print(now_move_distance)
        # 다음번 i번의 말이 위치하는 위치 인덱스
        next = yut[now][now_move_distance - 1]
        if next == 21:
            print(next)

        # 도착위치가 도착 넘어
        if next != -1 and next in dice:
            continue
        if next == -1:
            dice[i] = next
            check(count + 1, s)
            dice[i] = now
            continue
        dice[i] = next
        check(count + 1, s + score[next])
        dice[i] = now

# 말의 개수 4개
# 파란색 칸은 파란 화살표로 이동한다
# 이동했을 때 다른 말이 존재한다면 그 말은 선택 불가능 하지만
arr = list(map(int, input().split()))

# 각 인덱스에서 주사위 1,2,3,4,5 마다 갈 수 있는 인덱스
yut = {0: [1, 2, 3, 4, 5],
       1: [2, 3, 4, 5, 6],
       2: [3, 4, 5, 6, 7],
       3: [4, 5, 6, 7, 8],
       4: [5, 6, 7, 8, 9],
       5: [22, 23, 24, 25, 26],
       6: [7, 8, 9, 10, 11],
       7: [8, 9, 10, 11, 12],
       8: [9, 10, 11, 12, 13],
       9: [10, 11, 12, 13, 14],
       10: [28, 29, 25, 26, 27],
       11: [12, 13, 14, 15, 16],
       12: [13, 14, 15, 16, 17],
       13: [14, 15, 16, 17, 18],
       14: [15, 16, 17, 18, 19],
       15: [30, 31, 32, 25, 26],
       16: [17, 18, 19, 20, -1],
       17: [18, 19, 20, -1, -1],
       18: [19, 20, -1, -1, -1],
       19: [20, -1, -1, -1, -1],
       20: [-1, -1, -1, -1, -1],
       21: [-1, -1, -1, -1, -1],
       22: [23, 24, 25, 26, 27],
       23: [24, 25, 26, 27, 20],
       24: [25, 26, 27, 20, -1],
       25: [26, 27, 20, -1, -1],
       26: [27, 20, -1, -1, -1],
       27: [20, -1, -1, -1, -1],
       28: [29, 25, 26, 27, 20],
       29: [25, 26, 27, 20, -1],
       30: [31, 32, 25, 26, 27],
       31: [32, 25, 26, 27, 20],
       32: [25, 26, 27, 20, -1]
       }

# index 별 점수
score = {
    0: 0,
    1: 2,
    2: 4,
    3: 6,
    4: 8,
    5: 10,
    6: 12,
    7: 14,
    8: 16,
    9: 18,
    10: 20,
    11: 22,
    12: 24,
    13: 26,
    14: 28,
    15: 30,
    16: 32,
    17: 34,
    18: 36,
    19: 38,
    20: 40,
    21: 0,
    22: 13,
    23: 16,
    24: 19,
    25: 25,
    26: 30,
    27: 35,
    28: 22,
    29: 24,
    30: 28,
    31: 27,
    32: 26,
}

result = 0

# 주사위들의 현재 위치를 나타내는
dice = [0, 0, 0, 0]

check(0, 0)

print(result)