n,k = map(int,input().split())

# d[n][k] -> k개를 이용해서 n을 만드는 경우의 수
d = [[0] * 201 for _ in range(201)]

d[0][0] = 1

for i in range(n+1):
    for j in range(1,k+1):
        d[i][j] = (d[i][j-1] + d[i-1][j]) % 1000000000
print(d[n][k])
#   n   1   2   3   4   5   6
#k  1   1   1   1   1   1   1 -> 모든 n을 1가지로 만드는 방법은 n 1개
#   2   2   3   4
#   3   3   6   10  15  21  28
#   4   4   10  20  35  56  84
#      요기 n = 1 k = 2 이면 1을 2개 더해서 만드는거 -> (0,1) (1,0)
#           n = 1 k = 3 -> 1,0,0 / 0,1,0 / 0,0,1

# n = 2, k = 2 -> 1,1/ 2,0/ 0,2
#  n 3 k 2 -> 1,2/ 2,1 / 3,0 / 0,3
#  d[n][k] = d[n-1][k] + d[n][k-1]